[
  {"id": 1, "dua": "Allah'ım! Faydasız ilimden, ürpermeyen kalpten ve kabul olunmayan duadan sana sığınırım.", "kaynak": "Müslim"},
  {"id": 2, "dua": "Rabbimiz! Bize katından bir rahmet ver ve işimizde bizim için muvaffakiyet hazırla.", "kaynak": "Kehf, 10"},
  {"id": 3, "dua": "Allah'ım! Sen affedicisin, affetmeyi seversin, beni de affet.", "kaynak": "Tirmizi"},
  {"id": 4, "dua": "Rabbim! Göğsümü genişlet, işimi kolaylaştır, dilimin bağını çöz ki sözümü anlasınlar.", "kaynak": "Taha, 25-28"},
  {"id": 5, "dua": "Allah'ım! Kalplerimizi dinin üzere sabit kıl.", "kaynak": "Tirmizi"},
  {"id": 6, "dua": "Rabbim! ilmimi artır.", "kaynak": "Taha, 114"},
  {"id": 7, "dua": "Allah'ım! Senden hidayet, takva, iffet ve gönül zenginliği isterim.", "kaynak": "Müslim"},
  {"id": 8, "dua": "Rabbim! Beni ve neslimi namazı dosdoğru kılanlardan eyle.", "kaynak": "İbrahim, 40"},
  {"id": 9, "dua": "Allah'ım! Gazabından rızana, cezandan affına sığınırım.", "kaynak": "Müslim"},
  {"id": 10, "dua": "Rabbimiz! Hesabın görüleceği gün beni, anamı, babamı ve müminleri bağışla.", "kaynak": "İbrahim, 41"},
  {"id": 11, "dua": "Allah'ım! Senden hayırlı olanı isterim, hayırlı sonuçlar beklerim.", "kaynak": "Hadis-i Şerif"},
  {"id": 12, "dua": "Rabbim! Şeytanların kışkırtmalarından sana sığınırım.", "kaynak": "Müminun, 97"},
  {"id": 13, "dua": "Allah'ım! Günahlarımın küçüğünü büyüğünü, ilkini sonunu, gizlisini açığını bağışla.", "kaynak": "Müslim"},
  {"id": 14, "dua": "Rabbimiz! Bize dünyada iyilik ver, ahirette de iyilik ver. Bizi ateş azabından koru.", "kaynak": "Bakara, 201"},
  {"id": 15, "dua": "Allah'ım! Zulmetmekten ve zulme uğramaktan sana sığınırım.", "kaynak": "Nesai"},
  {"id": 16, "dua": "Rabbim! Beni tek başıma bırakma, Sen varislerin en hayırlısısın.", "kaynak": "Enbiya, 89"},
  {"id": 17, "dua": "Allah'ım! Senden sevgini ve seni sevenlerin sevgisini isterim.", "kaynak": "Tirmizi"},
  {"id": 18, "dua": "Rabbimiz! Nurumuzu tamamla ve bizi bağışla. Çünkü senin her şeye gücün yeter.", "kaynak": "Tahrim, 8"},
  {"id": 19, "dua": "Allah'ım! Kolaylaştırdığından başka hiçbir kolay yoktur. Sen istersen zoru kolay kılarsın.", "kaynak": "Hadis-i Şerif"},
  {"id": 20, "dua": "Rabbim! Gireceğim yere dürüstlükle girmemi, çıkacağım yerden dürüstlükle çıkmamı sağla.", "kaynak": "İsra, 80"},
  {"id": 21, "dua": "Allah'ım! Cimrilikten, korkaklıktan ve ömrün en rezil çağında kalmaktan sana sığınırım.", "kaynak": "Buhari"},
  {"id": 22, "dua": "Rabbim! Bana hikmet ver ve beni salihlere kat.", "kaynak": "Şuara, 83"},
  {"id": 23, "dua": "Allah'ım! Nefsime takvasını ver ve onu temizle. Onu temizleyenlerin en hayırlısı sensin.", "kaynak": "Müslim"},
  {"id": 24, "dua": "Rabbimiz! Bizi doğru yola ilettikten sonra kalplerimizi saptırma.", "kaynak": "Ali İmran, 8"},
  {"id": 25, "dua": "Allah'ım! Senden helal rızık, faydalı ilim ve kabul olunan amel isterim.", "kaynak": "İbn Mace"},
  {"id": 26, "dua": "Rabbim! Sen ancak affedicisin, affetmeyi seversin, beni de affet.", "kaynak": "Hadis-i Şerif"},
  {"id": 27, "dua": "Allah'ım! Kederden, üzüntüden, acizlikten ve tembellikten sana sığınırım.", "kaynak": "Buhari"},
  {"id": 28, "dua": "Rabbimiz! Sabır üzerimize yağdır ve Müslüman olarak canımızı al.", "kaynak": "Araf, 126"},
  {"id": 29, "dua": "Allah'ım! Kulağımın, gözümün ve kalbimin şerrinden sana sığınırım.", "kaynak": "Tirmizi"},
  {"id": 30, "dua": "Rabbim! Bana katından tertemiz bir nesil bağışla. Şüphesiz sen duaları işitensin.", "kaynak": "Ali İmran, 38"},
  {"id": 31, "dua": "Allah'ım! Sıkıntı ve darlıktan kurtuluş ver.", "kaynak": "Hadis-i Şerif"},
  {"id": 32, "dua": "Rabbimiz! Senden başka ilah yoktur, Seni tenzih ederiz. Biz zalimlerden olduk.", "kaynak": "Enbiya, 87"},
  {"id": 33, "dua": "Allah'ım! Her türlü zorluğu benim için kolaylaştır.", "kaynak": "Hadis-i Şerif"},
  {"id": 34, "dua": "Rabbim! Şükrünü yapabilmeyi, Seni anabilmeyi ve Sana güzelce ibadet edebilmeyi nasip et.", "kaynak": "Ebu Davud"},
  {"id": 35, "dua": "Allah'ım! Doğruyu söyleyen bir dil ve selim bir kalp isterim.", "kaynak": "Hadis-i Şerif"},
  {"id": 36, "dua": "Rabbimiz! Bize sabır ver ve ayaklarımızı dinin üzere sabit kıl.", "kaynak": "Bakara, 250"},
  {"id": 37, "dua": "Allah'ım! Borç altında ezilmekten ve insanların kahrından sana sığınırım.", "kaynak": "Hadis-i Şerif"},
  {"id": 38, "dua": "Rabbim! Beni bağışla, bana merhamet et, beni hidayet üzere kıl.", "kaynak": "Müslim"},
  {"id": 39, "dua": "Allah'ım! Şüphesiz biz Seni seviyoruz, Seni sevenleri de seviyoruz.", "kaynak": "Hadis-i Şerif"},
  {"id": 40, "dua": "Rabbimiz! Bizleri Sana teslim olmuş müslümanlar eyle.", "kaynak": "Bakara, 128"},
  {"id": 41, "dua": "Allah'ım! Öfke anında nefsimi kontrol etmeyi nasip et.", "kaynak": "Hadis-i Şerif"},
  {"id": 42, "dua": "Rabbim! Senden cenneti ve cennete yaklaştıran her söz ve ameli isterim.", "kaynak": "Hadis-i Şerif"},
  {"id": 43, "dua": "Allah'ım! Beni rızkınla kanaat edenlerden eyle.", "kaynak": "Hadis-i Şerif"},
  {"id": 44, "dua": "Rabbim! Anneme ve babama, onlar beni küçükken nasıl koruyup büyüttülerse, öylece merhamet et.", "kaynak": "İsra, 24"},
  {"id": 45, "dua": "Allah'ım! Hayatımın her anında Senin rızanı kazanmayı nasip et.", "kaynak": "Hadis-i Şerif"},
  {"id": 46, "dua": "Rabbimiz! Bizlere lütfettiğin nimetlerin şükrünü eda etmeyi nasip eyle.", "kaynak": "Hadis-i Şerif"},
  {"id": 47, "dua": "Allah'ım! Beni iyilik yaptığında sevinen, kötülük yaptığında istiğfar edenlerden eyle.", "kaynak": "Hadis-i Şerif"},
  {"id": 48, "dua": "Rabbim! Kalbimi temizle, dilimi dürüst kıl.", "kaynak": "Hadis-i Şerif"},
  {"id": 49, "dua": "Allah'ım! Senden ahirette selamet ve afiyet dilerim.", "kaynak": "Hadis-i Şerif"},
  {"id": 50, "dua": "Rabbim! İşlerimizi rast getir, bizi darda bırakma.", "kaynak": "Hadis-i Şerif"},
  {"id": 51, "dua": "Allah'ım! Gece ve gündüz gelecek her türlü beladan Sana sığınırım.", "kaynak": "Hadis-i Şerif"},
  {"id": 52, "dua": "Rabbimiz! Kusurlarımızı ört, bizi her türlü kötülükten koru.", "kaynak": "Hadis-i Şerif"},
  {"id": 53, "dua": "Allah'ım! Bize hakkı hak olarak göster ve ona uymayı nasip et.", "kaynak": "Hadis-i Şerif"},
  {"id": 54, "dua": "Rabbim! Yolumuzu ve ufkumuzu aydınlat.", "kaynak": "Hadis-i Şerif"},
  {"id": 55, "dua": "Allah'ım! Beni her an zikredenlerden ve şükredenlerden eyle.", "kaynak": "Hadis-i Şerif"},
  {"id": 56, "dua": "Rabbimiz! Senden selamet ve daimî huzur isteriz.", "kaynak": "Hadis-i Şerif"},
  {"id": 57, "dua": "Allah'ım! Amellerimizi halis kıl, sadece senin rızan için eyle.", "kaynak": "Hadis-i Şerif"},
  {"id": 58, "dua": "Rabbim! Bize İslam'ın izzetini ve güzelliğini yaşat.", "kaynak": "Hadis-i Şerif"},
  {"id": 59, "dua": "Allah'ım! Nefsimin şerrinden Sana sığınırım.", "kaynak": "Hadis-i Şerif"},
  {"id": 60, "dua": "Rabbimiz! Dualarımızı kabul buyur, Sen işiten ve bilensin.", "kaynak": "Hadis-i Şerif"}
]